perf/burst.yaml
config:
  target: 'http://localhost:5555'
  plugins:
    statsd:
      host: localhost
      port: 8125
      prefix: "artillery-burst"
  pool: 100
  phases:
    # Multiple repeated bursts with recovery periods
    - name: Baseline
      duration: 20
      arrivalRate: 2
    - name: Burst 1
      duration: 10
      arrivalRate: 50
    - name: Recovery 1
      duration: 20
      arrivalRate: 2
    - name: Burst 2
      duration: 10
      arrivalRate: 50
    - name: Recovery 2
      duration: 20
      arrivalRate: 2
    - name: Burst 3
      duration: 10
      arrivalRate: 50
    - name: Recovery 3
      duration: 20
      arrivalRate: 2
    - name: Burst 4
      duration: 10
      arrivalRate: 50
    - name: Recovery 4
      duration: 20
      arrivalRate: 2
    - name: Burst 5
      duration: 10
      arrivalRate: 50
    - name: Recovery 5
      duration: 20
      arrivalRate: 2
    - name: Burst 6
      duration: 10
      arrivalRate: 50
    - name: Recovery 6
      duration: 20
      arrivalRate: 2
    - name: Burst 7
      duration: 10
      arrivalRate: 50
    - name: Recovery 7
      duration: 20
      arrivalRate: 2
    - name: Burst 8
      duration: 10
      arrivalRate: 50
    - name: Final Recovery
      duration: 30
      arrivalRate: 2

scenarios:
  - name: Burst Test (/exchange)
    flow:
      - post:
          url: '/exchange'
          json:
            baseCurrency: 'ARS'
            counterCurrency: 'USD'
            baseAccountId: 1
            counterAccountId: 2
            baseAmount: 50
      - think: 1