perf/posts.yaml
config:
  target: 'http://localhost:5555'
  plugins:
    statsd:
      host: localhost
      port: 8125
      prefix: "artillery-api"
  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections
  phases:
    - name: Ramp
      duration: 30
      arrivalRate: 1
      rampTo: 5
    - name: Plain
      duration: 60
      arrivalRate: 5

scenarios:
  - name: Posts (/exchange)
    flow:
      - post:
          url: '/exchange'
          json:
            baseCurrency: 'ARS'
            counterCurrency: 'USD'
            baseAccountId: 1
            counterAccountId: 2
            baseAmount: 50
      - think: 1