perf/stress.yaml
config:
  target: 'http://localhost:5555'
  plugins:
    statsd:
      host: localhost
      port: 8125
      prefix: "artillery-stress"
  pool: 100
  phases:
    # Warm-up phase
    - name: Warm-up
      duration: 240
      arrivalRate: 100
    # Gradually increase load to find breaking point
    - name: Stress Level 1
      duration: 240
      arrivalRate: 200
    - name: Stress Level 2
      duration: 240
      arrivalRate: 300
    - name: Stress Level 3
      duration: 240
      arrivalRate: 400
    - name: Stress Level 4
      duration: 240
      arrivalRate: 500
    - name: Stress Level 5
      duration: 240
      arrivalRate: 600
    - name: Stress Level 6
      duration: 240
      arrivalRate: 700
    - name: Stress Level 7
      duration: 240
      arrivalRate: 800
    # Cool down to see recovery
    - name: Cool-down
      duration: 240
      arrivalRate: 100

scenarios:
  - name: Stress Test (/exchange)
    flow:
      - post:
          url: '/exchange'
          json:
            baseCurrency: 'BRL'
            counterCurrency: 'ARS'
            baseAccountId: 1
            counterAccountId: 2
            baseAmount: 5
      - think: 1